* Set up database
:PROPERTIES:
:header-args: sql :engine postgresql :dbuser nico :database workshop
:END:
** Create devices table. This table should have columns that meet the following specifications:

Includes a primary key called id that is auto-incrementing.
A column called name, that can contain a String. It cannot be NULL.
A column called created_at that lists the date this device was created. It should be of type timestamp and it should also have a default value related to when a device is created.

#+BEGIN_SRC sql
  CREATE TABLE devices(
    id serial PRIMARY KEY,
    name text NOT NULL,
  created_at timestamp);
#+END_SRC

#+RESULTS:
| CREATE TABLE |
|--------------|
** Create parts table
In the workshop, we have several devices, and each device should have many different parts. These parts are unique to each device, so one device can have various parts, but those parts won't be used in any other device. Make a table called parts that reflects the information listed above. Table parts should have the following columns that meet the following specifications:


#+BEGIN_SRC sql
  CREATE TABLE parts(
    id serial PRIMARY KEY,
    part_number int UNIQUE NOT NULL,
    device_id int REFERENCES devices(id));
#+END_SRC

#+RESULTS:
| CREATE TABLE |
|--------------|
** Correct devices table so that the created_at timestamp defaults to the current date-time

#+BEGIN_SRC sql
  ALTER TABLE devices
    ALTER COLUMN created_at SET DEFAULT CURRENT_TIMESTAMP;
#+END_SRC

#+RESULTS:
| ALTER TABLE |
|-------------|

